Импорт данных/Documents/ПродажаТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПродажаТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказыКлиентов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПродажиПоФилиалам</xr:Item>
				<xr:Item>AccumulationRegister.КоличествоТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПереченьТоваров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПоступления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Импорт данных/Documents/ПродажаТоваров/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПереченьТоваровКоличествоПриИзменении(Элемент)
	// актуализация строки табличной части
	СтрТабЧасти=Элементы.ПереченьТоваров.ТекущиеДанные;
	//Сумма=Цена*Кол-во
	СтрТабЧасти.Сумма=СтрТабЧасти.Цена*СтрТабЧасти.Количество;	
КонецПроцедуры

&НаКлиенте
Процедура ПереченьТоваровЦенаПриИзменении(Элемент)
	// актуализация строки табличной части
	СтрТабЧасти=Элементы.ПереченьТоваров.ТекущиеДанные;
	//Сумма=Цена*Кол-во
	СтрТабЧасти.Сумма=СтрТабЧасти.Цена*СтрТабЧасти.Количество;	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект=Объект.ПереченьТоваров;
	Сообщить("Общая сумма по документу "+ТекущийОбъект.Итог("Сумма")+ "руб.");
	
КонецПроцедуры

&НаКлиенте
Процедура ПереченьТоваровТоварПриИзменении(Элемент)
	СтрТабЧасти=Элементы.ПереченьТоваров.ТекущиеДанные;
	СтрТабЧасти.ЦенаПоступления=ОбщиеФункции.ЦенаНаДень(Объект.Дата, СтрТабЧасти.Товар);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦенуПоступления(Команда)
	СтрТабЧасти=Элементы.ПереченьТоваров.ТекущиеДанные;
	СтрТабЧасти.ЦенаПоступления=ОбщиеФункции.ЦенаНаДень(Объект.Дата, СтрТабЧасти.Товар);
КонецПроцедуры
